In [1]:
import sklearn
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
col_names = ['school_name', 'state_name', 'school_id', 'district_id', 'school_level', 'native', 'asian', 'hispanic', 'black', 'white', 'pacisl', 'mixed', 'total_race', 'free_lunch', 'reduced_lunch', 'total', 'st_ratio']
missing_values = ["–", "†", "‡"]
demos = pd.read_csv("demos.csv", names = col_names, na_values = missing_values, low_memory = False)
demos = demos.drop([0]).reset_index(drop=True)

demos = demos.loc[demos['school_level'] == '3-High']
demos = demos.drop(columns=['school_level'])

In [3]:
for i in range(2, len(demos.columns)):
    demos.iloc[:, i] = pd.to_numeric(demos.iloc[:, i], errors='coerce')
demos.total_race = demos.total_race.astype(float)
demos.school_id = demos.school_id.astype(float)
demos.district_id = demos.district_id.astype(float)

In [4]:
for i in range(4, 11):
    demos.iloc[:, i] = demos.iloc[:, i]/demos.total_race
demos.rename(columns={demos.columns[4]: "pct_native", demos.columns[5]: "pct_asian", demos.columns[6]: "pct_hispanic", demos.columns[7]: "pct_black", demos.columns[8]: "pct_white", demos.columns[9]: "pct_pacisl", demos.columns[10]: "pct_mixed"}, inplace = True)

for i in range(12, 14):
    demos.iloc[:, i] = demos.iloc[:, i]/demos.total
demos.rename(columns={demos.columns[12]: "pct_free_lunch", demos.columns[13]: "pct_reduced_lunch"})

demos = demos.drop(columns=['st_ratio'])
demos_add = demos.copy()
demos_add.to_csv("demos_clean.csv")

In [5]:
fields = ['LEAID', 'ALL_MTH00PCTPROF_1617', 'NCESSCH', 'MAM_MTH00PCTPROF_1617', 'MAS_MTH00PCTPROF_1617', 'MBL_MTH00PCTPROF_1617', 'MHI_MTH00PCTPROF_1617', 'MTR_MTH00PCTPROF_1617', 'ECD_MTH00PCTPROF_1617', 'HOM_MTH00PCTPROF_1617', 'MIG_MTH00PCTPROF_1617']
missing_values = ["PS"]
math_achi = pd.read_csv("math_achievement.csv", usecols = fields, na_values = missing_values, low_memory = False)
math_achi.head()

,LEAID,NCESSCH,ALL_MTH00PCTPROF_1617,MAM_MTH00PCTPROF_1617,MAS_MTH00PCTPROF_1617,MBL_MTH00PCTPROF_1617,MHI_MTH00PCTPROF_1617,MTR_MTH00PCTPROF_1617,ECD_MTH00PCTPROF_1617,HOM_MTH00PCTPROF_1617,MIG_MTH00PCTPROF_1617
0,100005,1.000050e+10,25,NaN,NaN,21-39,15,21-39,25,LT50,LE10
1,100005,1.000050e+10,13,NaN,NaN,LT50,LE5,NaN,13,NaN,LE20
2,100005,1.000050e+10,40,NaN,NaN,21-39,30,21-39,40,LT50,20-29
3,100005,1.000050e+10,49,NaN,NaN,21-39,40,21-39,49,LT50,20-29
4,100006,1.000060e+10,46,NaN,NaN,NaN,LT50,LT50,35-39,LT50,NaN

In [6]:
math_achi.replace({'GE':'', 'LE':'', 'GT':'', 'LT':''}, inplace = True, regex = True)

In [7]:
for k in range(2, len(math_achi.columns)):
    math_achi.iloc[:, k] = math_achi.iloc[:, k].str.split('-').str[0]

In [8]:
math_achi.head()

,LEAID,NCESSCH,ALL_MTH00PCTPROF_1617,MAM_MTH00PCTPROF_1617,MAS_MTH00PCTPROF_1617,MBL_MTH00PCTPROF_1617,MHI_MTH00PCTPROF_1617,MTR_MTH00PCTPROF_1617,ECD_MTH00PCTPROF_1617,HOM_MTH00PCTPROF_1617,MIG_MTH00PCTPROF_1617
0,100005,1.000050e+10,25,NaN,NaN,21,15,21,25,50,10
1,100005,1.000050e+10,13,NaN,NaN,50,5,NaN,13,NaN,20
2,100005,1.000050e+10,40,NaN,NaN,21,30,21,40,50,20
3,100005,1.000050e+10,49,NaN,NaN,21,40,21,49,50,20
4,100006,1.000060e+10,46,NaN,NaN,NaN,50,50,35,50,NaN

In [10]:
for l in range(len(math_achi.columns)):
    math_achi.iloc[:, l] = pd.to_numeric(math_achi.iloc[:, l], errors='coerce')
math_achi.NCESSCH = math_achi.NCESSCH.astype(float)

In [11]:
math_achi['agg_math_achi'] = math_achi.iloc[:, 2:].mean(axis=1)
math_achi = math_achi[['LEAID', 'NCESSCH', 'agg_math_achi']]

In [12]:
math_achi.head()

    LEAID       NCESSCH  agg_math_achi
0  100005  1.000050e+10      23.666667
1  100005  1.000050e+10      22.000000
2  100005  1.000050e+10      30.333333
3  100005  1.000050e+10      33.500000
4  100006  1.000060e+10      46.250000

In [13]:
fields = ['LEAID', 'NCESSCH', 'MAM_RLA00PCTPROF_1617', 'MAS_RLA00PCTPROF_1617', 'MBL_RLA00PCTPROF_1617', 'MHI_RLA00PCTPROF_1617', 'MTR_RLA00PCTPROF_1617', 'ECD_RLA00PCTPROF_1617', 'HOM_RLA00PCTPROF_1617', 'MIG_RLA00PCTPROF_1617']
missing_values = ["PS"]
rla_achi = pd.read_csv("rla_achievement.csv", usecols = fields, na_values = missing_values, low_memory = False)
rla_achi.head()

,LEAID,NCESSCH,MAM_RLA00PCTPROF_1617,MAS_RLA00PCTPROF_1617,MBL_RLA00PCTPROF_1617,MHI_RLA00PCTPROF_1617,MTR_RLA00PCTPROF_1617,ECD_RLA00PCTPROF_1617,HOM_RLA00PCTPROF_1617,MIG_RLA00PCTPROF_1617
0,100005,10000500870,NaN,NaN,21-39,25,40-59,34,LT50,11-19
1,100005,10000500871,NaN,NaN,LT50,10-14,NaN,27,NaN,LE20
2,100005,10000500879,NaN,NaN,LE20,14,21-39,26,LT50,LE10
3,100005,10000500889,NaN,NaN,LE20,15,21-39,27,LT50,11-19
4,100006,10000600193,NaN,NaN,NaN,LT50,LT50,35-39,LT50,NaN

In [14]:
rla_achi.replace({'GE':'', 'LE':'', 'GT':'', 'LT':''}, inplace = True, regex = True)

In [15]:
for k in range(2, len(rla_achi.columns)):
    rla_achi.iloc[:, k] = rla_achi.iloc[:, k].str.split('-').str[0]

In [16]:
for l in range(len(rla_achi.columns)):
    rla_achi.iloc[:, l] = pd.to_numeric(rla_achi.iloc[:, l], errors='coerce')
rla_achi.NCESSCH = rla_achi.NCESSCH.astype(float)

In [17]:
rla_achi['agg_rla_achi'] = rla_achi.iloc[:, 2:].mean(axis=1)
rla_achi = rla_achi[['NCESSCH', 'agg_rla_achi']]

In [18]:
rla_achi.head()

        NCESSCH  agg_rla_achi
0  1.000050e+10     30.166667
1  1.000050e+10     26.750000
2  1.000050e+10     23.500000
3  1.000050e+10     24.000000
4  1.000060e+10     46.250000

In [19]:
all_achi = pd.merge(math_achi, rla_achi, on='NCESSCH', how='inner')

In [20]:
all_achi.head()

    LEAID       NCESSCH  agg_math_achi  agg_rla_achi
0  100005  1.000050e+10      23.666667     30.166667
1  100005  1.000050e+10      22.000000     26.750000
2  100005  1.000050e+10      30.333333     23.500000
3  100005  1.000050e+10      33.500000     24.000000
4  100006  1.000060e+10      46.250000     46.250000

In [21]:
all_achi['agg_achi'] = all_achi.iloc[:, 2:].mean(axis=1)

In [22]:
all_achi = all_achi.dropna(subset=['agg_achi'])
df_blp2 = all_achi[['LEAID', 'agg_achi']]
all_achi = all_achi[['NCESSCH', 'agg_achi']]
all_achi = all_achi.rename(columns={'NCESSCH': 'school_id'})

In [23]:
all_achi.head()

      school_id   agg_achi
0  1.000050e+10  26.916667
1  1.000050e+10  24.375000
2  1.000050e+10  26.916667
3  1.000050e+10  28.750000
4  1.000060e+10  46.250000

In [24]:
all_achi.to_csv("all_achi.csv")

In [25]:
df_blp2.head()
df_blp2 = df_blp2.rename(columns={'LEAID': 'district_id'})

In [26]:
df_blp2.shape

(16687, 2)

In [27]:
df_blp2 = df_blp2.groupby('district_id').median(skipna=True)[['agg_achi']]
bins = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 101]
names = ['[0-10)', '[10-20)', '[20-30)', '[30-40)', '[40-50)', '[50-60)', '[60-70)', '[70-80)', '[80-90)', '[90-100]']
df_blp2['agg_achc'] = pd.cut(df_blp2.agg_achi, bins, labels = names, right = False)
df_blp2 = df_blp2.drop(columns=['agg_achi'])
df_blp2.T.iloc[:, 0:10]

district_id,100005,100006,100007,100008,100011,100012,100013,100030,100060,100090
agg_achc,[20-30),[30-40),[40-50),[50-60),[20-30),[40-50),[50-60),[20-30),[20-30),[20-30)

In [28]:
df1 = pd.merge(demos, all_achi, on='school_id', how='inner')
df1 = df1.drop(columns=['school_name', 'state_name', 'school_id', 'district_id', 'total_race'])
for i in range(len(df1.columns)):
    df1.iloc[:, i] = df1.iloc[:, i].fillna(df1.iloc[:, i].median(skipna=True))

In [29]:
df1.dtypes

pct_native       float64
pct_asian        float64
pct_hispanic     float64
pct_black        float64
pct_white        float64
pct_pacisl       float64
pct_mixed        float64
free_lunch       float64
reduced_lunch    float64
total            float64
agg_achi         float64
dtype: object

In [30]:
df1.size

35420

In [43]:
fields = ['NCESSCH', 'ALL_RATE_1617', 'MAM_RATE_1617', 'MAS_RATE_1617', 'MBL_RATE_1617', 'MHI_RATE_1617', 'MTR_RATE_1617', 'ECD_RATE_1617']
missing_values = [".", "PS"]
grad = pd.read_csv("grad.csv", usecols = fields, na_values = missing_values, low_memory = False)
grad.head()

,NCESSCH,ALL_RATE_1617,MAM_RATE_1617,MAS_RATE_1617,MBL_RATE_1617,MHI_RATE_1617,MTR_RATE_1617,ECD_RATE_1617
0,10000500871,93,NaN,NaN,GE50,90-94,NaN,NaN
1,10000600872,90-94,NaN,NaN,NaN,GE80,NaN,NaN
2,10000600878,85-89,NaN,NaN,NaN,GE90,NaN,NaN
3,10000600883,90-94,NaN,NaN,NaN,NaN,NaN,NaN
4,10000601585,85-89,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
for k in range(1, len(grad.columns)):
    grad.iloc[:, k] = grad.iloc[:, k].str.split('-').str[0]

In [45]:
for l in range(len(grad.columns)):
    grad.iloc[:, l] = pd.to_numeric(grad.iloc[:, l], errors='coerce')
grad.NCESSCH = grad.NCESSCH.astype(float)

In [46]:
grad = grad.rename(columns={'NCESSCH': 'school_id', 'ALL_RATE_1617': 'grad_rate_all', 'MAM_RATE_1617': 'grad_rate_native', 'MAS_RATE_1617': 'grad_rate_asian', 'MBL_RATE_1617': 
                           'grad_rate_black', 'MHI_RATE_1617': 'grad_rate_hispanic', 'MTR_RATE_1617': 'grad_rate_mixed', 'ECD_RATE_1617': 'grad_rate_linc'})
grad.dtypes

school_id             float64
grad_rate_all         float64
grad_rate_native      float64
grad_rate_asian       float64
grad_rate_black       float64
grad_rate_hispanic    float64
grad_rate_mixed       float64
grad_rate_linc        float64
dtype: object

In [47]:
grad.to_csv("grad_clean.csv")

In [36]:
financials = pd.read_csv("financials.txt", delimiter = "\t", low_memory = False)
financials = financials.drop([0]).reset_index(drop=True)

In [37]:
financials = financials[['LEAID', 'TOTALREV', 'TLOCREV', 'T02', 'T06', 'T09', 'T15', 'T40', 'T99', 'Z32', 'Z33', 'Z35']]
financials = financials.rename(columns={'LEAID': 'district_id', 'TOTALREV': 'total_rev', 'TLOCREV': 'total_locrev', 'T02': 'pta_rev', 'T06': 'prop_taxes', 'T09': 'sales_taxes', 'T15': 'public_utility_taxes', 'T40': 'income_taxes', 'T99': 'other_taxes', 'Z32': 'total_salaries', 'Z33': 'salaries_instruction', 'Z35': 'salaries_teachers'})

In [38]:
financials.iloc[:, 1:] = financials.iloc[:, 1:].clip(0)

In [39]:
financials.head()

,district_id,total_rev,total_locrev,pta_rev,prop_taxes,sales_taxes,public_utility_taxes,income_taxes,other_taxes,total_salaries,salaries_instruction,salaries_teachers
0,0100005,45519000,12503000,0,4663000,0,0,0,388000,22798000,14900000,10992000
1,0100006,55501000,13248000,0,6536000,0,0,0,96000,29650000,17898000,12245000
2,0100007,163058000,86878000,0,66946000,0,0,0,4000,84171000,56693000,45336000
3,0100008,103675000,44505000,0,18041000,0,0,0,6000,49609000,32902000,23499000
4,0100009,0,0,0,0,0,0,0,0,0,0,0

In [40]:
financials.iloc[:, 1:][financials.iloc[:, 1:] > 0].count()

total_rev               16938
total_locrev            16758
pta_rev                  1084
prop_taxes              12104
sales_taxes               497
public_utility_taxes     1206
income_taxes              956
other_taxes              2777
total_salaries          16417
salaries_instruction    16200
salaries_teachers       13836
dtype: int64

In [41]:
financials = financials[financials.apply(pd.to_numeric, errors='coerce').notna()].dropna()
financials.district_id = financials.district_id.astype(float)

In [42]:
financials.to_csv("financials_clean.csv")